# Виселица
# Класическая игра Виселица. Компьютер случайным образом выбирает слово и словаря, далее игрок по букве отгадывает слово
# если игрок ответил неправильно за отведённое ему количество попыток, на экране появится повешенный человек
# импорт модуля
import random
HANGMAN = (
"""
---------
|       |
|
|
|
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |
|
|
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   -+-
|
|
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   /-+-
|
|
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   /-+-/
|
|
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   /-+-/
|       |
|  
|
|
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   /-+-/
|       |
|       |
|      |
|      |
|
|
|
|
----------
""",
"""
---------
|       |
|       0   |   /-+-/
|       |
|       |
|      |  |
|      |  |
|
|
|
|
----------
""")
WORDS = ["питон","ящерица","дикобраз","динозавр","алигатор","мангуст","змея","крокодил","черепаха","мамонт"]
MAX_WRONG = len(HANGMAN) - 1
word = random.choice(WORDS)
so_far = "-" * len(word)
wrong = 0
used = []
while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("Буквы которые уже были введены", used)
    print("\nОтгаданное вами слово сейчас выглядит вот так:", so_far)
    guess = input("\nВведите букву: ")
    if guess in used:
        print("Вы уж предлагали эту букву:", guess)
        guess = input("Введите букву: ")
    used.append(guess)
    if guess in word:
        print("\nДа! Буква", guess, "есть в слове")
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print("Такой буквы", guess, "нет в слове")
        wrong += 1
    if wrong == MAX_WRONG:
        print(HANGMAN[wrong])
        print("\nВас повесили, правильное слово было -", word)
    else:
        print("\nВы угадали! Правильное слово и вправду было:", word)
input("\nPress enter to exit")